import { partitionAllCurios } from '@/libs/du/curio-utils'
import type { Curio } from '@/libs/du/types'

const CURIOS: Curio[] = [
  {
    _id: 9521,
    Name: "祈祷之路",
    Desc: "<color style='color:#f29e38;'>「巡猎」</color><color style='color:#f29e38;'>「智识」</color>命途角色生命上限提高 60% ，回合开始时，消耗 15% 当前生命值，并获得等同于生命上限 25% 的护盾。",
    Icon: "1145",
    Type: 5
  },
  {
    _id: 9520,
    Name: "自动化体验",
    Desc: "<color style='color:#f29e38;'>「毁灭」</color><color style='color:#f29e38;'>「虚无」</color>命途角色施放攻击后，使受到攻击的敌方目标行动提前 20% ，并使其造成的伤害降低 30% ，持续 1 回合",
    Icon: "1149",
    Type: 5
  },
  {
    _id: 9519,
    Name: "故事的现在时",
    Desc: "<color style='color:#f29e38;'>「记忆」</color>命途的忆灵每次消失或累计经过 8 回合后，使忆师的攻击力/生命上限/速度/防御力提高，提高数值等同于忆灵的 8% ，最多使忆师的上述属性提高基础数值的 60% ",
    Icon: "1142",
    Type: 5
  },
  {
    _id: 9518,
    Name: "利他者的末路",
    Desc: "<color style='color:#f29e38;'>「虚数」</color> 属性我方目标累计生命降低值，在任意单位行动后，为随机<color style='color:#f29e38;'>「量子」</color> 属性我方目标恢复等同于该值 50% 的生命值，每回合的治疗量不超过治疗者生命上限的 50% 。<color style='color:#f29e38;'>「量子」</color>属性我方目标累计生命降低值，在任意单位行动后，使随机<color style='color:#f29e38;'>「虚数」</color> 属性我方目标下次施放攻击后，对攻击目标造成等同于该值 300% 的量子属性附加伤害",
    Icon: "1122",
    Type: 5
  },
  {
    _id: 9517,
    Name: "熵的逆命题",
    Desc: "进入战斗时，<color style='color:#f29e38;'>「风」</color><color style='color:#f29e38;'>「雷」</color>属性我方目标的击破特攻提高，提高至队伍中击破特攻最高的我方目标的 120% ",
    Icon: "1128",
    Type: 5
  },
  {
    _id: 9516,
    Name: "偶有越狱",
    Desc: "<color style='color:#f29e38;'>「存护」</color>命途角色与<color style='color:#f29e38;'>「记忆」</color>命途忆灵，当前生命值等于生命上限时，受到攻击的概率大幅提高且受到的伤害降低 30% ；每回合首次受到攻击后，我方全体回复等同于各自生命上限 20% 的生命值，且造成的伤害提高 50% ，持续 2 回合。",
    Icon: "1125",
    Type: 5
  },
  {
    _id: 9515,
    Name: "拟赤月",
    Desc: "<color style='color:#f29e38;'>「丰饶」</color>命途角色攻击敌方目标时，有 150% 的基础概率使其陷入【坏死】状态：回合开始时，受到等同于角色攻击力 600% 的火属性持续伤害，持续 3 回合，并使当前承受的其他灼烧状态立刻产生相当于原伤害 200% 的伤害",
    Icon: "1124",
    Type: 5
  },
  {
    _id: 9514,
    Name: "静谧的歌声",
    Desc: "<color style='color:#f29e38;'>「同谐」</color>命途角色对我方目标施放普攻/战技/终结技时，为我方全体角色提供能够抵消等同于各自生命上限 25% 伤害的护盾，持续 2 回合",
    Icon: "1119",
    Type: 5
  },
  {
    _id: 9513,
    Name: "十光年不晚",
    Desc: "<color style='color:#f29e38;'><color style='color:#f29e38;'>「巡猎」</color></color>命途角色发动攻击造成伤害时，对相邻目标额外造成等同于原伤害 40% 的伤害",
    Icon: "1129",
    Type: 5
  },
  {
    _id: 9512,
    Name: "通向彗星之路",
    Desc: "<color style='color:#f29e38;'>「冰」</color>属性我方目标造成伤害提高 50% ，速度提高 10% ，提供护盾量提高 10% 。战斗中同时有 3 名及以上<color style='color:#f29e38;'>「冰」</color>属性角色或忆灵时，使效果数值提高原数值的 200% ，并对我方全体目标生效",
    Icon: "1095",
    Type: 5
  },
  {
    _id: 9511,
    Name: "风中花蕾",
    Desc: "<color style='color:#f29e38;'>「风」</color>属性我方目标施放攻击后，使攻击目标陷入1层【太阳风】，最多叠加 10 层。<color style='color:#f29e38;'>「雷」</color>属性我方目标施放攻击后，清除攻击目标所有【太阳风】，每清除1层，对其造成 600% <u>基础伤害</u>的风属性伤害<br><b>基础伤害</b><br>敌方目标等级、阈值协议越高，造成的基础伤害越高。",
    Icon: "1102",
    Type: 5
  },
  {
    _id: 9510,
    Name: "天才的迷茫时间",
    Desc: "<color style='color:#f29e38;'>「量子」</color>属性我方目标获得战技点后，使我方全体获得 2 层【激发】，我方目标施放普攻/战技发动攻击后，消耗全体1层【激发】对攻击目标造成等同于 250% 攻击力的量子属性附加伤害，并有 50% 基础概率使其陷入纠缠状态，持续1回合",
    Icon: "1094",
    Type: 5
  },
  {
    _id: 9509,
    Name: "神圣容颜",
    Desc: "<color style='color:#f29e38;'>「物理」</color>属性角色数量大于等于 2 时，这些角色击破特攻提高 200% ，攻击造成 75% 的无视弱点削韧，且击破敌方目标弱点时对敌方全体造成 200% 的物理属性击破伤害",
    Icon: "1107",
    Type: 5
  },
  {
    _id: 9508,
    Name: "美味球藻糖",
    Desc: "<color style='color:#f29e38;'>「物理」「火」</color>属性角色施放终结技后，会使我方全体回复等同于生命上限 25% 的生命值，并使自身速度提高 20% ，持续 2 回合，最多叠加 2 层",
    Icon: "1091",
    Type: 5
  },
  {
    _id: 9507,
    Name: "喧哗上等",
    Desc: "<color style='color:#f29e38;'>「火」</color>属性角色数量为1/2/3/4时，造成的火属性持续伤害提高等同于攻击力的 50% / 100% / 150% / 300% ，施放攻击后，使攻击目标当前承受的灼烧状态立即产生相当于原伤害 30% 的伤害",
    Icon: "1098",
    Type: 5
  },
  {
    _id: 9506,
    Name: "平行宇宙对讲机",
    Desc: "<color style='color:#f29e38;'>「智识」</color>角色攻击消灭敌方目标后，若伤害溢出，对攻击目标中当前生命值最高的目标造成 1000% <u>基础伤害</u>+ 100% 溢出值的真实伤害<br><b>基础伤害</b><br>敌方目标等级、阈值协议越高，造成的基础伤害越高。",
    Icon: "1105",
    Type: 5
  },
  {
    _id: 9505,
    Name: "入梦罐",
    Desc: "非「同谐」命途我方目标施放攻击后，会为我方随机<color style='color:#f29e38;'>「同谐」</color>命途角色提供 1 层【和弦】：最多叠加 30 层，施放普攻后，消耗【和弦】层数，每消耗1层，对攻击目标造成 500% <u>基础伤害</u>的伤害<br><b>基础伤害</b><br>敌方目标等级、阈值协议越高，造成的基础伤害越高。",
    Icon: "1106",
    Type: 5
  },
  {
    _id: 9504,
    Name: "醒觉 -310 ",
    Desc: "<color style='color:#f29e38;'>「虚数」「冰」</color> 属性我方目标施加的控制状态无视冻结/控制/禁锢抗性，解除时对敌方目标造成 1500% 的<u>基础伤害</u>并使其造成的伤害降低 5% ，造成的伤害与施加的伤害降低可叠加，最多叠加 4 次<br><b>基础伤害</b><br>敌方目标等级、阈值协议越高，造成的基础伤害越高。",
    Icon: "1097",
    Type: 5
  },
  {
    _id: 9503,
    Name: "石语者结片",
    Desc: "<color style='color:#f29e38;'>「雷」</color>属性我方目标会抵抗所有使自身陷入控制类负面状态的效果，触发该效果时，行动提前 50% 。每受到1%行动提前效果，下回合造成的伤害提高 1% ，最多提高 200% ",
    Icon: "1108",
    Type: 5
  },
  {
    _id: 9502,
    Name: "云间肉排",
    Desc: "<color style='color:#f29e38;'>「毁灭」「虚无」</color>命途角色击破特攻提高 25% 。攻击处于弱点击破状态的敌方目标后，以 80% 的比例触发火、风、雷、物理属性的击破效果，敌方目标每次被弱点击破后最多触发 1 次效果",
    Icon: "1113",
    Type: 5
  },
  {
    _id: 9501,
    Name: "尊严与热忱",
    Desc: "队伍中有<color style='color:#f29e38;'>「存护」</color>命途角色时，我方目标获得特殊护盾，获得其他护盾时该护盾会增加获取护盾量 100% 的护盾量。超过生命上限 30% 的部分，会在回合开始时失去 90% ，并回复失去护盾量 10% 的生命值",
    Icon: "1101",
    Type: 5
  },
  {
    _id: 9500,
    Name: "营养过剩",
    Desc: "我方目标受到来自<color style='color:#f29e38;'>「丰饶」</color> 命途角色的治疗后，获得等同于溢出治疗量 100% 的可叠加护盾，该护盾上限等同于我方目标生命上限的 50% ，回合结束时移除",
    Icon: "1111",
    Type: 5
  },
  {
    _id: 8901,
    Name: "高热饮食（破解版）",
    Desc: "进入战斗时，获得随机临界方程效果，不会覆盖已激活临界方程效果",
    Icon: "1141",
    Type: 3
  },
  {
    _id: 8172,
    Name: "精确优雅的代码",
    Desc: "进入战斗时，我方目标防御力、攻击力、生命上限提高 35% ，攻击后对随机攻击目标造成 350% 攻击力的附加伤害，对4星我方目标效果额外提高原数值的 200% ",
    Icon: "420004",
    Type: 3
  },
  {
    _id: 8171,
    Name: "无限递归的代码",
    Desc: "进入战斗时，我方目标生命上限提高 20% ，对4星我方目标效果额外提高原数值的 100% 。获得该奇物时，若同时携带全部错误代码，将令代码实现精确优雅的自我迭代",
    Icon: "420006",
    Type: 1
  },
  {
    _id: 8170,
    Name: "有点蹊跷的代码",
    Desc: "进入战斗时，我方目标攻击力提高 20% ，对4星我方目标效果额外提高原数值的 100% 。获得该奇物时，若同时携带全部错误代码，将令代码实现精确优雅的自我迭代",
    Icon: "420002",
    Type: 1
  },
  {
    _id: 8169,
    Name: "没有注释的代码",
    Desc: "进入战斗时，我方目标防御力提高 20% ，对4星我方目标效果额外提高原数值的 100% 。获得该奇物时，若同时携带全部错误代码，将令代码实现精确优雅的自我迭代",
    Icon: "420005",
    Type: 1
  },
  {
    _id: 8168,
    Name: "片刻安谧",
    Desc: "获得该奇物时，立即获得 5 个随机1星方程。获得该奇物或2-3星方程时，将所有2-3星方程替换为随机1星方程。每有1个已激活的1星方程，我方全体造成的伤害提高 25% ，激活 4 个或以上1星方程时，伤害加成提高到 35% ",
    Icon: "1157",
    Type: 3
  },
  {
    _id: 8167,
    Name: "铸铁的齿轮指环",
    Desc: "获得宇宙碎片的数量提高 30% ，但商店中物品的售价和覆写祝福、方程消耗的宇宙碎片数量提高 30% ",
    Icon: "1138",
    Type: 1
  },
  {
    _id: 8166,
    Name: "深度睡眠",
    Desc: "出现【冒险】区域的概率提升。进入【冒险】区域时获得 50 宇宙碎片，完成区域时的奖励档位提升1档",
    Icon: "1162",
    Type: 2
  },
  {
    _id: 8165,
    Name: "绑架机器人",
    Desc: "出现【遭遇】区域的概率提高。累计进入 1 / 3 / 5 次【遭遇】区域时，获得1个随机1/2/3星方程，触发所有效果后该奇物损毁",
    Icon: "1150",
    Type: 2
  },
  {
    _id: 8164,
    Name: "自适应礼品盒",
    Desc: "获得该奇物时，失去所有宇宙碎片，然后随机获得失去值 10% - 200% 的宇宙碎片",
    Icon: "1159",
    Type: 1
  },
  {
    _id: 8163,
    Name: "机运长袍",
    Desc: "进入【事件】区域时，失去 150 宇宙碎片并将事件替换为奖励，宇宙碎片不足时该奇物损毁",
    Icon: "1154",
    Type: 2
  },
  {
    _id: 8162,
    Name: "知识注射枪",
    Desc: "祝福和奇物商店中出现 2 个免费商品，其他商品的售价提高 100% ",
    Icon: "1169",
    Type: 1
  },
  {
    _id: 8161,
    Name: "杀死那只蝴蝶",
    Desc: "累计开启 6 个宝箱后，出现宝箱【奇遇】区域的概率大幅提升。进入【奇遇】区域后，丢弃该奇物",
    Icon: "1135",
    Type: 2
  },
  {
    _id: 8160,
    Name: "昨天的重量",
    Desc: "进入区域时，获得 35 宇宙碎片，当宇宙碎片减少次数累计达到 3 次时，该奇物损毁",
    Icon: "1164",
    Type: 1
  },
  {
    _id: 8159,
    Name: "铸铁的机动指环",
    Desc: "获得宇宙碎片的数量降低 50% ，覆写方程和祝福消耗的宇宙碎片数量降低 100% ，覆写祝福的次数上限降低为 7 ",
    Icon: "1137",
    Type: 1
  },
  {
    _id: 8158,
    Name: "丰裕滚石",
    Desc: "进入第三位面，及第三位面获得该奇物时，获得1个金血祝颂",
    Icon: "1163",
    Type: 1
  },
  {
    _id: 8157,
    Name: "狂欢之尾",
    Desc: "所有奇物获得时触发的效果会额外触发1次，每个区域最多触发 3 次",
    Icon: "1165",
    Type: 3
  },
  {
    _id: 8156,
    Name: "不眠鸱鸮",
    Desc: "白昼时，我方全体回复量与获得的护盾量提高 20% ，受到的伤害降低 12% ，且攻击敌方目标时有 25% 的概率选择错误的目标",
    Icon: "1151",
    Type: 2
  },
  {
    _id: 8155,
    Name: "法度刻印",
    Desc: "夜晚时，我方全体速度提高 25% ，暴击伤害提高 50% ，且行动条变为不可见状态",
    Icon: "1153",
    Type: 2
  },
  {
    _id: 8154,
    Name: "快乐电视机",
    Desc: "连续进入相同区域时，失去 25 宇宙碎片和 1 个随机奇物",
    Icon: "1167",
    Type: 4
  },
  {
    _id: 8153,
    Name: "虫群录像带",
    Desc: "祝福排排乐和奇物大转盘消耗的宇宙碎片数量提高 25% ",
    Icon: "1152",
    Type: 4
  },
  {
    _id: 8152,
    Name: "同谐火漆",
    Desc: "获得该奇物时，随机获得 1 个「同谐」的祝福。并在战斗胜利后选择祝福时，提高「同谐」的祝福出现的概率",
    Icon: "1158",
    Type: 1
  },
  {
    _id: 8151,
    Name: "垂语果实",
    Desc: "立即获得 4 个随机祝福。失去此奇物后会再次获得它",
    Icon: "1161",
    Type: 2
  },
  {
    _id: 8150,
    Name: "垂语果实",
    Desc: "立即获得 4 个随机祝福。失去此奇物后会再次获得它",
    Icon: "1161",
    Type: 2
  },
  {
    _id: 8149,
    Name: "垂语果实",
    Desc: "立即获得 3 个随机祝福。失去此奇物后会再次获得它，并使奖励的祝福数量提高 1 个，最多提高至 4 个",
    Icon: "1161",
    Type: 2
  },
  {
    _id: 8148,
    Name: "垂语果实",
    Desc: "立即获得 2 个随机祝福。失去此奇物后会再次获得它，并使奖励的祝福数量提高 1 个，最多提高至 4 个",
    Icon: "1161",
    Type: 2
  },
  {
    _id: 8147,
    Name: "垂语果实",
    Desc: "立即获得 1 个随机祝福。失去此奇物后会再次获得它，并使奖励的祝福数量提高 1 个，最多提高至 4 个",
    Icon: "1161",
    Type: 2
  },
  {
    _id: 8146,
    Name: "神启石镜",
    Desc: "进入【遭遇】或【奖励】区域时，有 30% 概率获得 1 个方程所需的祝福",
    Icon: "1166",
    Type: 2
  },
  {
    _id: 8145,
    Name: "神启石镜",
    Desc: "进入【遭遇】或【奖励】区域时，有 50% 概率获得 1 个随机祝福",
    Icon: "1166",
    Type: 2
  },
  {
    _id: 8144,
    Name: "神启石镜",
    Desc: "进入【遭遇】或【奖励】区域时，有 30% 概率获得 1 个随机奇物",
    Icon: "1166",
    Type: 2
  },
  {
    _id: 8143,
    Name: "神启石镜",
    Desc: "进入【遭遇】或【奖励】区域时，有 50% 概率获得 1 个随机奇物，可能包含负面奇物",
    Icon: "1166",
    Type: 2
  },
  {
    _id: 8142,
    Name: "神启石镜",
    Desc: "进入【战斗】或【事件】区域时，有 30% 概率获得 1 个方程所需的祝福",
    Icon: "1166",
    Type: 2
  },
  {
    _id: 8141,
    Name: "神启石镜",
    Desc: "进入【战斗】或【事件】区域时，有 50% 概率获得 1 个随机祝福",
    Icon: "1166",
    Type: 2
  },
  {
    _id: 8140,
    Name: "神启石镜",
    Desc: "进入【战斗】或【事件】区域时，有 30% 概率获得 1 个随机奇物",
    Icon: "1166",
    Type: 2
  },
  {
    _id: 8139,
    Name: "神启石镜",
    Desc: "进入【战斗】或【事件】区域时，有 50% 概率获得 1 个随机奇物，可能包含负面奇物",
    Icon: "1166",
    Type: 2
  },
  {
    _id: 8138,
    Name: "真实机兵",
    Desc: "失去奇物时，获得 75 宇宙碎片",
    Icon: "1168",
    Type: 2
  },
  {
    _id: 8137,
    Name: "绝对自灭药膏",
    Desc: "立即获得 2 个方程所需的祝福，失去 2 个方程不需要的祝福",
    Icon: "1156",
    Type: 1
  },
  {
    _id: 8136,
    Name: "量子大乐透",
    Desc: "摧毁可破坏物时有小概率获得负面奇物，但也有小概率使该奇物损毁。奇物损毁时，获得 400 宇宙碎片",
    Icon: "1136",
    Type: 1
  },
  {
    _id: 8135,
    Name: "祭献投枪",
    Desc: "进入【战斗】【转化】【遭遇】【首领】区域时，获得 35 宇宙碎片，连续进入时额外获得 35 宇宙碎片。进入【事件】【奖励】【冒险】【财富】区域时失去 35 宇宙碎片",
    Icon: "1155",
    Type: 1
  },
  {
    _id: 8134,
    Name: "沉吟圆盘",
    Desc: "进入【财富】区域时，将宝箱替换为诅咒宝箱，生效后该奇物损毁。奇物损毁时获得 2 个随机1星方程",
    Icon: "1160",
    Type: 2
  },
  {
    _id: 8133,
    Name: "沉吟圆盘",
    Desc: "进入【遭遇】区域时，我方全体损失 20% 当前生命值，生效后该奇物损毁。奇物损毁时获得 2 个1-2星奇物",
    Icon: "1160",
    Type: 2
  },
  {
    _id: 8132,
    Name: "沉吟圆盘",
    Desc: "进入【战斗】区域时，将敌人替换为普通精英，生效后该奇物损毁。奇物损毁时获得 2 个祝福",
    Icon: "1160",
    Type: 2
  },
  {
    _id: 8131,
    Name: "沉吟圆盘",
    Desc: "进入【事件】区域时，固定出现2个微妙的事件。生效后该奇物损毁",
    Icon: "1160",
    Type: 2
  },
  {
    _id: 8130,
    Name: "旧皮囊",
    Desc: "在造物调试台中，减少 1 点可使用热量",
    Icon: "1120",
    Type: 4
  },
  {
    _id: 8129,
    Name: "菠萝",
    Desc: "累计进入 3 个区域后该奇物损毁，并使我方全体损失 99% 当前生命值",
    Icon: "1115",
    Type: 4
  },
  {
    _id: 8128,
    Name: "绝对失败处方",
    Desc: "进入战斗时，我方全体损失全部能量并消耗所有战技点",
    Icon: "1103",
    Type: 4
  },
  {
    _id: 8127,
    Name: "绝对失败处方",
    Desc: "进入战斗时，我方全体弱点击破效率降低 100% ，持续 1 回合",
    Icon: "1103",
    Type: 4
  },
  {
    _id: 8126,
    Name: "绝对失败处方",
    Desc: "进入战斗时，我方全体造成的伤害降低 99% ，持续 1 回合",
    Icon: "1103",
    Type: 4
  },
  {
    _id: 8125,
    Name: "绝对失败处方",
    Desc: "进入战斗时，我方全体消耗等同于当前生命值 50% 的生命值",
    Icon: "1103",
    Type: 4
  },
  {
    _id: 8124,
    Name: "绝对失败处方",
    Desc: "进入战斗时，我方全体第一次受到攻击后，额外消耗等同于角色当前生命值 50% 的生命值",
    Icon: "1103",
    Type: 4
  },
  {
    _id: 8123,
    Name: "绝对失败处方",
    Desc: "进入战斗时，我方全体有 150% 的基础概率陷入裂伤状态，持续 5 回合，裂伤状态下，回合开始时受到等同于生命上限 20% 的物理属性持续伤害",
    Icon: "1103",
    Type: 4
  },
  {
    _id: 8122,
    Name: "绝对失败处方",
    Desc: "进入战斗时，我方全体有 150% 的基础概率陷入冻结状态，持续 1 回合",
    Icon: "1103",
    Type: 4
  },
  {
    _id: 8121,
    Name: "绝对失败处方",
    Desc: "进入战斗时，敌方全体行动提前 100% ",
    Icon: "1103",
    Type: 4
  },
  {
    _id: 8120,
    Name: "天彗合金Ⅲ型",
    Desc: "无效果，同时最多持有一个",
    Icon: "1109",
    Type: 2
  },
  {
    _id: 8119,
    Name: "塔洛特玩偶",
    Desc: "进入战斗时，我方全体对敌方目标施放技能时有 50% 概率选择错误的目标， 4 次战斗后，该奇物损毁",
    Icon: "1093",
    Type: 4
  },
  {
    _id: 8118,
    Name: "「奇思狂想」机器团",
    Desc: "角色施放秘技时，额外消耗 1 秘技点",
    Icon: "1076",
    Type: 4
  },
  {
    _id: 8117,
    Name: "「极佳念头」彩虹机",
    Desc: "携带该奇物进入【冒险】区域后，使得该区域的限制时间降低 30% ",
    Icon: "1075",
    Type: 4
  },
  {
    _id: 8116,
    Name: "「中等念头」群体机",
    Desc: "商品价格提高 25% ",
    Icon: "1083",
    Type: 4
  },
  {
    _id: 8115,
    Name: "「无效念头」代码机",
    Desc: "进入战斗时，角色失去等同于能量上限的能量",
    Icon: "1071",
    Type: 4
  },
  {
    _id: 8114,
    Name: "分裂咕咕钟",
    Desc: "角色攻击力降低 5% 。",
    Icon: "1053",
    Type: 4
  },
  {
    _id: 8113,
    Name: "分裂咕咕钟",
    Desc: "角色攻击力降低 5% 。",
    Icon: "1053",
    Type: 4
  },
  {
    _id: 8112,
    Name: "分裂咕咕钟",
    Desc: "角色攻击力降低 5% 。",
    Icon: "1053",
    Type: 4
  },
  {
    _id: 8111,
    Name: "分裂咕咕钟",
    Desc: "角色攻击力降低 5% ，战斗胜利后有概率分裂出1个复制体，复制体最多同时存在 3 个",
    Icon: "1053",
    Type: 4
  },
  {
    _id: 8110,
    Name: "破碎咕咕钟",
    Desc: "战斗胜利后获得的宇宙碎片降低 25% ，展开 1 个方程后奇物损毁",
    Icon: "1059",
    Type: 4
  },
  {
    _id: 8109,
    Name: "机械咕咕钟",
    Desc: "进入战斗时，消耗 2 个战技点",
    Icon: "1010",
    Type: 4
  },
  {
    _id: 8108,
    Name: "公司咕咕钟",
    Desc: "覆写祝福、覆写方程所需的宇宙碎片数量提高 25% ",
    Icon: "1039",
    Type: 4
  },
  {
    _id: 8107,
    Name: "永动咕咕钟",
    Desc: "每进入下一区域，损失 4% 当前持有的宇宙碎片",
    Icon: "1041",
    Type: 4
  },
  {
    _id: 8106,
    Name: "黑森林咕咕钟",
    Desc: "进入战斗时，随机使 1 名我方目标被敌方目标攻击的概率大幅提高，持续 5 回合",
    Icon: "1038",
    Type: 4
  },
  {
    _id: 8105,
    Name: "卜筮咕咕钟",
    Desc: "战斗胜利后，选择祝福时，可选择的祝福选项会减少 1 个",
    Icon: "1040",
    Type: 4
  },
  {
    _id: 8104,
    Name: "英雄凯旋",
    Desc: "进入战斗时，对生命值最高的敌方目标造成等同于其生命上限 100% 的伤害，并获得 88 宇宙碎片，在首领区域造成的伤害减半",
    Icon: "1148",
    Type: 3
  },
  {
    _id: 8103,
    Name: "虚高一丈",
    Desc: "获得 1 / 2 / 3 星奇物时，立即获得 20 / 40 / 120 宇宙碎片。每拥有1个 1 / 2 / 3 星奇物，进入战斗时，使我方目标攻击力提高 3% / 6% / 20% ",
    Icon: "1132",
    Type: 3
  },
  {
    _id: 8102,
    Name: "入乡随俗",
    Desc: "【财富】区域会出现更多游乐装置。提高【战斗】【事件】【遭遇】【奖励】【交易】区域额外游乐装置出现的概率。将出现特殊的祝福排排乐和奇物大转盘，且使用次数增加。每游玩一次游乐装置，我方全体造成的伤害提高 10% ",
    Icon: "1127",
    Type: 3
  },
  {
    _id: 8101,
    Name: "与死重逢",
    Desc: "立即获得 1 个当前无法展开的方程。每展开1个方程后，立即获得1个随机当前无法展开方程，最多通过该方式获得 3 个方程。每有1个展开的方程，使我方全体造成的伤害提高 10% ",
    Icon: "1112",
    Type: 3
  },
  {
    _id: 8100,
    Name: "鲁珀特帝国差分机",
    Desc: "获得该奇物以及每进入区域时，获得 200 宇宙碎片， 2 个随机祝福和 2 个随机奇物。进入战斗时，我方全体暴击率提高 60% ，暴击伤害提高 16% ",
    Icon: "1088",
    Type: 3
  },
  {
    _id: 8099,
    Name: "瘟疫巢都",
    Desc: "立即获得 4 个随机负面奇物，进入区域时随机失去最多 1 个负面奇物，并获得等量随机祝福。每通过这种方式失去1个负面奇物，进入战斗时我方全体造成的伤害提高 10% ",
    Icon: "1096",
    Type: 3
  },
  {
    _id: 8098,
    Name: "记忆轮",
    Desc: "立即获得 2 个随机方程。每进入区域时，将所有方程置换为随机相同星级方程。进入战斗时，获得所有未展开方程的效果",
    Icon: "1086",
    Type: 3
  },
  {
    _id: 8097,
    Name: "湮灭烛剪",
    Desc: "每击碎1个可破坏物，进入战斗时，我方全体造成的伤害提高 5% ，每开启一个战利品，我方全体生命上限提高 8% ",
    Icon: "1046",
    Type: 3
  },
  {
    _id: 8096,
    Name: "龋齿星系模型",
    Desc: "立即失去 30% 宇宙碎片。每通过任意方式失去 100 宇宙碎片，进入战斗时我方全体暴击伤害提高 15% ",
    Icon: "1065",
    Type: 3
  },
  {
    _id: 8095,
    Name: "家族缘结",
    Desc: "立即获得 2 个可损毁奇物。每当奇物损毁时，立即获得 1 个可损毁奇物。每拥有1个已损毁的奇物，进入战斗时，我方全体造成的伤害提高 30% ",
    Icon: "1057",
    Type: 3
  },
  {
    _id: 8094,
    Name: "纯美之袍",
    Desc: "进入战斗时，每拥有 100 宇宙碎片，我方全体造成的伤害提高 20% 。进入【战斗】、【遭遇】或【首领】区域时，获得等同于当前持有宇宙碎片 6% 的宇宙碎片",
    Icon: "1014",
    Type: 3
  },
  {
    _id: 8093,
    Name: "奥塔牌",
    Desc: "第三位面首领将为【步离战首·呼雷（完整）】，在第三位面【首领】区域进入战斗时，我方全体造成的伤害提高 50% ",
    Icon: "1140",
    Type: 2
  },
  {
    _id: 8091,
    Name: "奥塔牌",
    Desc: "第三位面首领将为【奇想林中的蕉研组（完整）】，在第三位面【首领】区域进入战斗时，我方全体造成的伤害提高 50% ",
    Icon: "1140",
    Type: 2
  },
  {
    _id: 8090,
    Name: "奥塔牌",
    Desc: "第三位面首领将为【浮烟（完整）】，在第三位面【首领】区域进入战斗时，我方全体造成的伤害提高 50% ",
    Icon: "1140",
    Type: 2
  },
  {
    _id: 8089,
    Name: "奥塔牌",
    Desc: "第三位面首领将为【蛮神，疯王，纷争的化身（完整）】，在第三位面【首领】区域进入战斗时，我方全体造成的伤害提高 50% ",
    Icon: "1140",
    Type: 2
  },
  {
    _id: 8088,
    Name: "末日复眼•先行版",
    Desc: "获得该奇物时，立即获得 4 个拥有祝福数量最多的命途的祝福。覆写祝福、覆写方程所需的宇宙碎片提高 1000% ",
    Icon: "1144",
    Type: 2
  },
  {
    _id: 8087,
    Name: "无人通讯",
    Desc: "奇物损毁时，使其恢复如新。效果触发 2 次后，该奇物损毁",
    Icon: "1147",
    Type: 2
  },
  {
    _id: 8086,
    Name: "天才俱乐部危险八卦",
    Desc: "无法获得宇宙碎片，每因为该奇物的效果损失 100 宇宙碎片，获得 1 个随机 1 - 3 星奇物，累计获得 5 个奇物后损毁",
    Icon: "1146",
    Type: 1
  },
  {
    _id: 8085,
    Name: "和平箱",
    Desc: "展开 1 个 2 星及以上方程后，获得 1 个随机祝福，效果最多触发 5 次",
    Icon: "1143",
    Type: 2
  },
  {
    _id: 8084,
    Name: "高热饮食",
    Desc: "进入战斗时，获得随机临界方程效果，战斗胜利 1 次后，该奇物损毁。不会覆盖已激活临界方程效果",
    Icon: "1141",
    Type: 2
  },
  {
    _id: 8083,
    Name: "古老通讯",
    Desc: "出现次元扑满的概率大幅提高，进入存在次元扑满的区域后，该奇物损毁",
    Icon: "1117",
    Type: 2
  },
  {
    _id: 8082,
    Name: "有形幸运",
    Desc: "进入区域时，如果宇宙碎片数量小于 250 ，则将宇宙碎片补足为 250 ",
    Icon: "1134",
    Type: 2
  },
  {
    _id: 8081,
    Name: "无主失物",
    Desc: "出现【奇遇】区域的概率提高，每次进入区域时，概率额外提高。进入【奇遇】区域后，丢弃该奇物",
    Icon: "1131",
    Type: 2
  },
  {
    _id: 8080,
    Name: "化作尘泥",
    Desc: "在造物调试台中，额外获得 5 点可使用热量",
    Icon: "1118",
    Type: 2
  },
  {
    _id: 8079,
    Name: "塔奥牌",
    Desc: "累计进入 4 个区域后，该奇物损毁，并失去 2 个随机祝福",
    Icon: "1114",
    Type: 2
  },
  {
    _id: 8078,
    Name: "塔奥牌",
    Desc: "展开 1 个方程后，获得 2 个随机祝福。效果触发 2 次后，该奇物损毁",
    Icon: "1114",
    Type: 2
  },
  {
    _id: 8077,
    Name: "塔奥牌",
    Desc: "连续进入相同类型的区域后，获得 1 个随机祝福。效果触发 3 次后，该奇物损毁",
    Icon: "1114",
    Type: 2
  },
  {
    _id: 8076,
    Name: "塔奥牌",
    Desc: "战斗胜利后，获得 1 个随机祝福。效果触发 3 次后，该奇物损毁",
    Icon: "1114",
    Type: 2
  },
  {
    _id: 8075,
    Name: "塔奥牌",
    Desc: "获取的宇宙碎片数量降低 30% 。累计进入 3 个区域后，该奇物损毁",
    Icon: "1114",
    Type: 2
  },
  {
    _id: 8074,
    Name: "塔奥牌",
    Desc: "在商店中购买祝福、奇物和方程时，返还 40% 花费的宇宙碎片。离开【商店】区域后，该奇物损毁",
    Icon: "1114",
    Type: 2
  },
  {
    _id: 8073,
    Name: "塔奥牌",
    Desc: "进入区域时，获得 150 宇宙碎片。累计进入 3 个区域后，该奇物损毁",
    Icon: "1114",
    Type: 2
  },
  {
    _id: 8072,
    Name: "塔奥牌",
    Desc: "获取的宇宙碎片数量提高 50% 。累计进入 4 个区域后，该奇物损毁",
    Icon: "1114",
    Type: 2
  },
  {
    _id: 8071,
    Name: "塔奥牌",
    Desc: "进入战斗时，角色受到攻击后，消耗 10 点能量，持续 2 回合。累计 3 次战斗后，该奇物损毁",
    Icon: "1114",
    Type: 2
  },
  {
    _id: 8070,
    Name: "塔奥牌",
    Desc: "我方目标受到攻击后，回复等同于生命上限 15% 的生命值。累计 4 次战斗后，该奇物损毁",
    Icon: "1114",
    Type: 2
  },
  {
    _id: 8069,
    Name: "塔奥牌",
    Desc: "我方全体速度提高 30% 。累计 4 次战斗后，该奇物损毁",
    Icon: "1114",
    Type: 2
  },
  {
    _id: 8068,
    Name: "塔奥牌",
    Desc: "进入战斗时，敌方全体行动延后 200% 。累计 4 次战斗后，该奇物损毁",
    Icon: "1114",
    Type: 2
  },
  {
    _id: 8067,
    Name: "天彗合金Ⅱ型",
    Desc: "无效果，同时最多持有一个",
    Icon: "1109",
    Type: 1
  },
  {
    _id: 8066,
    Name: "喜乐熏香",
    Desc: "获得该奇物时，获得 2 个随机方程。在【首领】区域进入战斗时，每有1个未展开的方程，敌方全体生命上限提高 40% ，攻击力提高 20% ",
    Icon: "1110",
    Type: 2
  },
  {
    _id: 8065,
    Name: "朋克洛德问候",
    Desc: "进入战斗时，我方编队中的第一位角色速度提高 40% ，最后一位角色速度降低 40% ",
    Icon: "1104",
    Type: 2
  },
  {
    _id: 8064,
    Name: "阿阮袋",
    Desc: "立刻获得 3 个随机祝福，战斗胜利后选择祝福时选项数量变为1， 2 次战斗后该奇物损毁",
    Icon: "1078",
    Type: 2
  },
  {
    _id: 8063,
    Name: "海绵王",
    Desc: "每进入一个区域，我方全体损失 80% 当前生命值，生命上限提高 10% ，效果触发 4 次后该奇物损毁，生命上限提高效果在奇物损毁后仍会生效",
    Icon: "1072",
    Type: 2
  },
  {
    _id: 8062,
    Name: "腐化异木果实",
    Desc: "角色会抵抗所有使自身陷入控制类负面状态的效果。每次抵抗都会消耗等同于自身 20% 生命上限的生命值",
    Icon: "1073",
    Type: 2
  },
  {
    _id: 8061,
    Name: "理性的溃败",
    Desc: "获得该奇物时，立即获得 3 个不同命途的随机 1 星祝福各 1 个",
    Icon: "1080",
    Type: 2
  },
  {
    _id: 8060,
    Name: "人造陨石球",
    Desc: "获得该奇物时，立即获得 1 - 3 个拥有祝福数量最多的命途的祝福",
    Icon: "1061",
    Type: 2
  },
  {
    _id: 8059,
    Name: "一撮胡须火药",
    Desc: "获得该奇物时，获得 1 个加权奇物",
    Icon: "1066",
    Type: 2
  },
  {
    _id: 8058,
    Name: "虚构机兵",
    Desc: "角色回合开始时，回复等同于其生命上限 20% 的生命值",
    Icon: "1064",
    Type: 2
  },
  {
    _id: 8057,
    Name: "纯美骑士精神",
    Desc: "获得该奇物时，获得 1 个随机方程",
    Icon: "1051",
    Type: 2
  },
  {
    _id: 8056,
    Name: "愚者面具",
    Desc: "将所有祝福替换为随机祝福，强化情况会被保留，且有概率替换为更高稀有度的祝福",
    Icon: "1067",
    Type: 2
  },
  {
    _id: 8055,
    Name: "天才俱乐部普通八卦",
    Desc: "获得该奇物后，获得宇宙碎片时额外获得 50% ，但战斗结束无法再获取祝福",
    Icon: "1063",
    Type: 2
  },
  {
    _id: 8054,
    Name: "星际大乐透",
    Desc: "击碎可破坏物后有小概率获得1个随机祝福，但也有小概率使该奇物损毁并使我方全体损失全部能量与秘技点",
    Icon: "1068",
    Type: 1
  },
  {
    _id: 8053,
    Name: "分裂银币",
    Desc: "立即获得等同于当前持有的宇宙碎片 50% 的宇宙碎片",
    Icon: "1045",
    Type: 2
  },
  {
    _id: 8052,
    Name: "银河大乐透",
    Desc: "击碎可破坏物后有小概率获得1件奇物，但也有小概率使该奇物损毁并使我方全体损失 99% 当前生命值",
    Icon: "1026",
    Type: 1
  },
  {
    _id: 8051,
    Name: "时空棱镜",
    Desc: "进入战斗时，所有角色星魂同调等级提高 1 级",
    Icon: "1028",
    Type: 2
  },
  {
    _id: 8050,
    Name: "碎星芳饵",
    Desc: "场景中角色移动速度提高 40% 。角色速度提高 10% ",
    Icon: "1029",
    Type: 1
  },
  {
    _id: 8049,
    Name: "智识火漆",
    Desc: "获得该奇物时，随机获得1个「智识」的祝福。并在战斗胜利后选择祝福时，提高「智识」的祝福出现的概率",
    Icon: "1082",
    Type: 1
  },
  {
    _id: 8048,
    Name: "繁育火漆",
    Desc: "获得该奇物时，随机获得1个「繁育」的祝福。并在战斗胜利后选择祝福时，提高「繁育」的祝福出现的概率",
    Icon: "1052",
    Type: 1
  },
  {
    _id: 8047,
    Name: "虚无火漆",
    Desc: "获得该奇物时，随机获得1个「虚无」的祝福。并在战斗胜利后选择祝福时，提高「虚无」的祝福出现的概率",
    Icon: "1047",
    Type: 1
  },
  {
    _id: 8046,
    Name: "记忆火漆",
    Desc: "获得该奇物时，随机获得1个「记忆」的祝福。并在战斗胜利后选择祝福时，提高「记忆」的祝福出现的概率",
    Icon: "1024",
    Type: 1
  },
  {
    _id: 8045,
    Name: "毁灭火漆",
    Desc: "获得该奇物时，随机获得1个「毁灭」的祝福。并在战斗胜利后选择祝福时，提高「毁灭」的祝福出现的概率",
    Icon: "1023",
    Type: 1
  },
  {
    _id: 8044,
    Name: "巡猎火漆",
    Desc: "获得该奇物时，随机获得1个「巡猎」的祝福。并在战斗胜利后选择祝福时，提高「巡猎」的祝福出现的概率",
    Icon: "1022",
    Type: 1
  },
  {
    _id: 8043,
    Name: "欢愉火漆",
    Desc: "获得该奇物时，随机获得1个「欢愉」的祝福。并在战斗胜利后选择祝福时，提高「欢愉」的祝福出现的概率",
    Icon: "1021",
    Type: 1
  },
  {
    _id: 8042,
    Name: "闪耀的偏方三八面骰",
    Desc: "获得该奇物后将当前持有的包含该奇物在内的所有奇物替换为随机奇物",
    Icon: "1035",
    Type: 2
  },
  {
    _id: 8041,
    Name: "分裂金币",
    Desc: "每进入下一区域，获得等同于当前持有的宇宙碎片 5% 的宇宙碎片。进入【财富】区域时，将宝箱替换为更好的宝箱",
    Icon: "1015",
    Type: 2
  },
  {
    _id: 8040,
    Name: "福灵胶",
    Desc: "战斗胜利后选择祝福时，出现的祝福必定是3星的祝福。获得 1 次战斗胜利后，该奇物损毁",
    Icon: "1007",
    Type: 2
  },
  {
    _id: 8039,
    Name: "降维骰子",
    Desc: "战斗胜利后选择祝福时可以额外选择 1 次祝福，但可选择的祝福选项会减少 1 个。效果触发 2 次后该奇物损毁",
    Icon: "1001",
    Type: 2
  },
  {
    _id: 8038,
    Name: "超霸王陀螺",
    Desc: "我方目标击破特攻提高 30% 。敌方目标进入战斗时，被削减等同于韧性上限 50% 的韧性，该效果不会击破敌方目标弱点",
    Icon: "1116",
    Type: 1
  },
  {
    _id: 8037,
    Name: "埋点土",
    Desc: "获得 3 / 6 / 9 场战斗胜利后，获得 50 / 150 / 250 宇宙碎片。获得 9 场战斗胜利后，该奇物损毁",
    Icon: "1123",
    Type: 1
  },
  {
    _id: 8036,
    Name: "有梦 -0110 ",
    Desc: "进入战斗时，我方全体造成的伤害提高 50% ， 15 回合后，受到的伤害提高 10% ",
    Icon: "1133",
    Type: 1
  },
  {
    _id: 8035,
    Name: "水上书",
    Desc: "进入区域时，我方全体回复全部生命值、能量值与秘技点，并重置所有陷入无法战斗状态的角色",
    Icon: "1130",
    Type: 2
  },
  {
    _id: 8034,
    Name: "朋克洛德平衡",
    Desc: "敌方目标进入战斗时，受到等同于各自生命上限 99% 的固定数值的伤害，【首领】和【转化】区域无效。获得 2 场战斗胜利后，该奇物损毁",
    Icon: "1126",
    Type: 1
  },
  {
    _id: 8033,
    Name: "朋克洛德精神",
    Desc: "进入战斗时，有 100% 固定概率为敌方全体添加 1 个场上我方目标持有属性的弱点，持续 10 回合",
    Icon: "1048",
    Type: 1
  },
  {
    _id: 8032,
    Name: "信标着色剂",
    Desc: "战斗胜利后，选择祝福时，随机强化其中 1 个祝福",
    Icon: "1036",
    Type: 1
  },
  {
    _id: 8031,
    Name: "天彗合金Ⅰ型",
    Desc: "无效果，同时最多持有一个",
    Icon: "1109",
    Type: 1
  },
  {
    _id: 8030,
    Name: "天彗合金",
    Desc: "获得该奇物时，立即获得奇物【天彗合金Ⅰ型】、【天彗合金Ⅱ型】和【天彗合金Ⅲ型】",
    Icon: "1109",
    Type: 1
  },
  {
    _id: 8029,
    Name: "挣扎的色彩",
    Desc: "进入区域时，额外战利品的出现概率提高，且固定为混沌药箱",
    Icon: "1099",
    Type: 1
  },
  {
    _id: 8028,
    Name: "临时赌资",
    Desc: "立即获得 300 宇宙碎片，累计进入 5 个区域后，该奇物损毁，并失去 450 宇宙碎片",
    Icon: "1087",
    Type: 1
  },
  {
    _id: 8027,
    Name: "断骨剑",
    Desc: "在第一、二位面中，我方全体受到的伤害提高 20% ，在第三位面中，我方全体受到的伤害降低 12% ",
    Icon: "1085",
    Type: 1
  },
  {
    _id: 8026,
    Name: "自我意识的舒张压",
    Desc: "进入战斗时会进入自动战斗状态且无法解除。我方全体造成的伤害提高 30% ，生命上限提高 30% ",
    Icon: "1100",
    Type: 1
  },
  {
    _id: 8025,
    Name: "猜不透匣",
    Desc: "战斗胜利后获得的祝福，至少有1个与方程所需的命途相同",
    Icon: "1037",
    Type: 2
  },
  {
    _id: 8024,
    Name: "「楼梯上的水母」",
    Desc: "失去所有祝福，并按照失去祝福的星级之和获得宇宙碎片，每有1个星级获得 80 宇宙碎片",
    Icon: "1081",
    Type: 2
  },
  {
    _id: 8023,
    Name: "和平的代价",
    Desc: "进入【商店】区域时，获得 150 宇宙碎片",
    Icon: "1074",
    Type: 1
  },
  {
    _id: 8022,
    Name: "许愿星",
    Desc: "【冒险】区域的出现概率大幅提高。携带该奇物进入【冒险】区域后，使得该区域的限制时间提高 50% ，并在进入区域时额外获得一个宝箱，效果触发 2 次后该奇物损毁",
    Icon: "1042",
    Type: 2
  },
  {
    _id: 8021,
    Name: "粉红冲撞",
    Desc: "每拥有1种不同命途的祝福，所有角色击破特攻提高 20% ",
    Icon: "1060",
    Type: 1
  },
  {
    _id: 8020,
    Name: "塔拉毒火焰",
    Desc: "进入战斗时，使当前攻击力最高的我方目标，每回合开始时消耗等同于生命上限 24% 的生命值。同时使其速度提高 5% ，速度提高的效果最多叠加 5 次",
    Icon: "1062",
    Type: 1
  },
  {
    _id: 8019,
    Name: "邪恶机械卫星#900",
    Desc: "商品价格降低 30% ",
    Icon: "1050",
    Type: 2
  },
  {
    _id: 8018,
    Name: "鲁珀特帝国机械活塞",
    Desc: "每次进入区域时，获得 2 个随机奇物，有可能是负面奇物，并失去 1 个随机奇物。若通过该方式将自身丢弃，失去所有奇物。获得该奇物时，若同时携带全部鲁珀特帝国机械系列奇物，将引发反有机方程的局域共鸣",
    Icon: "1090",
    Type: 1
  },
  {
    _id: 8017,
    Name: "鲁珀特帝国机械杠杆",
    Desc: "每次进入区域时，获得 1 个方程所需的随机祝福，随机失去 1 个方程不需要的祝福，若没有祝福可以通过该方式失去，该奇物损毁。获得该奇物时，若同时携带全部鲁珀特帝国机械系列奇物，将引发反有机方程的局域共鸣",
    Icon: "1089",
    Type: 1
  },
  {
    _id: 8016,
    Name: "鲁珀特帝国机械齿轮",
    Desc: "每次进入区域时，获得 50 宇宙碎片，如果此时宇宙碎片超过 750 ，该奇物损毁，并失去所有宇宙碎片。获得该奇物时，若同时携带全部鲁珀特帝国机械系列奇物，将引发反有机方程的局域共鸣",
    Icon: "1070",
    Type: 1
  },
  {
    _id: 8015,
    Name: "万识囊",
    Desc: "可破坏物会更频繁地出现，且被击碎后获得的收益翻倍",
    Icon: "1030",
    Type: 1
  },
  {
    _id: 8014,
    Name: "换境桂冠",
    Desc: "若在与非最终区域中的敌人的战斗中失败，不会导致本次探索中断，而会视为本次战斗胜利并使所有角色的当前生命值回复至各自的生命上限。效果触发 1 次后该奇物损毁",
    Icon: "1032",
    Type: 1
  },
  {
    _id: 8013,
    Name: "天使型谢债发行机",
    Desc: "战斗胜利后，无法获得宇宙碎片。效果触发 5 次后该奇物损毁并使当前拥有的宇宙碎片数量翻倍",
    Icon: "1044",
    Type: 1
  },
  {
    _id: 8012,
    Name: "虫网",
    Desc: "进入战斗时，使当前攻击力最高的我方目标陷入【寄生】状态。【寄生】状态下，我方目标的攻击力提高 50% ，但在回合开始时会消耗等同于当前生命值 20% 的生命值。当陷入无法战斗状态后，该状态将转移给随机其他我方目标",
    Icon: "1019",
    Type: 1
  },
  {
    _id: 8011,
    Name: "万象无常骰",
    Desc: "获得该奇物后立即随机强化 2 个祝福",
    Icon: "1034",
    Type: 1
  },
  {
    _id: 8010,
    Name: "天外重声大碟",
    Desc: "进入战斗时，所有我方目标可抵抗除持续伤害外的所有伤害，受到攻击后解除，并在 3 回合内不会陷入负面效果",
    Icon: "1031",
    Type: 1
  },
  {
    _id: 8009,
    Name: "空无烛剪",
    Desc: "获得该奇物后将随机修复最多 2 个已损毁的1-3星奇物，使其效果的剩余次数恢复至初始状态",
    Icon: "1017",
    Type: 2
  },
  {
    _id: 8008,
    Name: "信仰债券",
    Desc: "覆写祝福、覆写方程以及复活陷入无法战斗状态的角色所需的宇宙碎片数量降低 30% ",
    Icon: "1013",
    Type: 2
  },
  {
    _id: 8007,
    Name: "俱乐部券",
    Desc: "战斗胜利后获得宇宙碎片的数量提高 40% ",
    Icon: "1012",
    Type: 1
  },
  {
    _id: 8006,
    Name: "博士之袍",
    Desc: "进入战斗时，若拥有已展开的3星方程，使所有角色激活终结技，并使造成的伤害提高 25% ",
    Icon: "1011",
    Type: 1
  },
  {
    _id: 8005,
    Name: "永不停嘴的羊皮卷",
    Desc: "进入战斗时，敌方全体受到等同于各自生命上限 30% 的固定数值的伤害",
    Icon: "1008",
    Type: 1
  },
  {
    _id: 8004,
    Name: "香涎干酪",
    Desc: "战斗胜利后，我方全体回复等同于各自生命上限 100% 的生命值，效果触发3.0次后该奇物升级为「海绵王」",
    Icon: "1006",
    Type: 1
  },
  {
    _id: 8003,
    Name: "测不准匣",
    Desc: "获得该奇物后立即获得 1 - 2 个随机祝福，展开 2 个方程后，该奇物升级为「猜不透匣」",
    Icon: "1005",
    Type: 1
  },
  {
    _id: 8002,
    Name: "异木果实",
    Desc: "我方全体效果抵抗提高 30% ，生命上限降低 20% 。战斗胜利 3 次后该奇物升级为「腐化异木果实」",
    Icon: "1004",
    Type: 1
  },
  {
    _id: 8001,
    Name: "跃迁复眼",
    Desc: "战斗胜利后选择祝福时，强化所有出现的品质为1星的祝福",
    Icon: "1003",
    Type: 1
  },
  {
    _id: 8000,
    Name: "记忆轮（破解版）",
    Desc: "进入战斗时，获得所有未展开方程的效果",
    Icon: "1086",
    Type: 3
  }
]

const PARTITIONED_CURIOS = partitionAllCurios(CURIOS)

export { CURIOS, PARTITIONED_CURIOS }
