import type { Path } from '@/libs/du/constants'

interface PathEffectsDetail {
  Name: string
  Desc: string
}

interface PathEffects {
  _id: Path
  Icon: string
  E1: PathEffectsDetail
  E2: PathEffectsDetail
}

const pathEffects: PathEffects[] = [
  {
    _id: 121,
    Icon: 'Remembrance',
    E1: {
      Name: '执念',
      Desc: '每层使我方全体目标攻击力提高 1% ，生命上限提高 0.5% ，每名目标最多拥有 20 层，回合结束时失去 2 层。',
    },
    E2: {
      Name: '执念-特性',
      Desc: '我方目标进入战斗/忆灵被召唤时获得 8 层【执念】，行动后有 26% 固定概率获得1层【执念】。每拥有1个「记忆」祝福，固定概率额外提高 3% ，最多计入 8 个记忆祝福。',
    },
  },
  {
    _id: 122,
    Icon: 'Nihility',
    E1: {
      Name: '呢喃',
      Desc: '敌方目标进入战斗时陷入该状态，视为风化状态，回合开始时造成等同于充能值的风属性持续伤害，并清除超过阈值的充能值，清除阈值为我方角色攻击力之和的 4000% 。',
    },
    E2: {
      Name: '呢喃-特性',
      Desc: '敌方目标受到持续伤害时，【呢喃】获得等同于伤害 8% 的充能值，不超过我方角色攻击力之和的 40% 。每拥有1个「虚无」祝福，我方目标造成的持续伤害提高 10% ，最多计入 8 个。',
    },
  },
  {
    _id: 124,
    Icon: 'Hunt',
    E1: {
      Name: '会心',
      Desc: '每层使暴击率提高 6% ，暴击伤害提高 12% ，该效果最多叠加 8 层，可以传递给下一个回合开始的我方目标。当任意我方目标受到攻击后层数清零。',
    },
    E2: {
      Name: '会心-特性',
      Desc: '我方角色施放技能后有 20% 固定概率获得1层【会心】。每拥有1个「巡猎」祝福，固定概率提高 10% ，最多计入 8 个「巡猎」祝福。',
    },
  },
  {
    _id: 125,
    Icon: 'Destruction',
    E1: {
      Name: '耀变',
      Desc: '生命值变化值或护盾降低值的 30% 会转化为【耀变】充能值，充能值在回合开始时清除 60% ，【耀变】可基于该充能值造成伤害等效果。',
    },
    E2: {
      Name: '耀变-特性',
      Desc: '【耀变】基础值不低于生命上限的 60% ，受到攻击后，根据【耀变】的 40% 对攻击者造成附加伤害，该伤害无法消灭敌方目标。每拥有1个「毁灭」祝福，该伤害额外提高【耀变】值的 10% ，最多计入 8 个「毁灭」祝福。',
    },
  },
  {
    _id: 126,
    Icon: 'Elation',
    E1: {
      Name: '回味',
      Desc: '随机属性的附加伤害，该伤害视为追加攻击伤害。',
    },
    E2: {
      Name: '回味-特性',
      Desc: '我方目标发动追加攻击后，对受到攻击的敌方目标造成1次等同于攻击力 50% 的【回味】伤害。每拥有1个「欢愉」祝福，该【回味】伤害额外提高攻击力的 10% ，最多计入 8 个「欢愉」祝福。',
    },
  },
  {
    _id: 127,
    Icon: 'Propagation',
    E1: {
      Name: '魂茧/蝶魄',
      Desc: '【魂茧】为我方全体共享的充能比例，达到 100% 时变为【蝶魄】。进入【蝶魄】状态后，我方目标接下来 8 次施放普攻/战技发动攻击后，对攻击目标造成1次等同于除附加伤害外原伤害 50% 的真实伤害。',
    },
    E2: {
      Name: '魂茧/蝶魄-特性',
      Desc: '进入战斗时，【魂茧】获得 60% 充能，每消耗1个战技点，获得 8% 充能。每拥有1个「繁育」祝福，我方目标造成的普攻/战技伤害提高 10% ，最多计入 8 个「繁育」祝福。',
    },
  },
  {
    _id: 128,
    Icon: 'Erudition',
    E1: {
      Name: '罐中脑',
      Desc: '若【罐中脑】的启迪充能比例达到 100% ，角色使用【罐中脑】以外的方式施放终结技后，会再次激活终结技，通过该方式施放终结技会消耗 100% 的启迪充能。',
    },
    E2: {
      Name: '罐中脑-特性',
      Desc: '角色每次使用【罐中脑】以外的方式施放终结技时，为【罐中脑】充能 20% 。每拥有1个「智识」祝福，造成的终结技伤害提高 10% ，最多计入 8 个「智识」祝福。',
    },
  },
  {
    _id: 129,
    Icon: 'Harmony',
    E1: {
      Name: '和音',
      Desc: '持有者受到的击破伤害提高 25% 。回合开始时，若处于弱点击破状态，则基于【和音】层数，每层受到 60% 基础伤害的量子属性击破伤害，最多叠加 40 层，从弱点击破状态恢复时清除。',
    },
    E2: {
      Name: '和音-特性',
      Desc: '我方目标弱点击破效率提高 24% ，每拥有1个「同谐」祝福，额外提高 2% ，最多计入 8 个「同谐」祝福。击破敌方目标弱点时，使其陷入 5 层【和音】。',
    },
  },
]

export { pathEffects }
export type { PathEffects }
